db.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-06-26 Mon 10:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CS-322: Introduction to Database Systems</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="/home/raph/school/theme.css"/>
</head>
<body>
<div id="content">
<h1 class="title">CS-322: Introduction to Database Systems</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge2f9b08">1. B+trees</a></li>
<li><a href="#org9299931">2. Sorting</a>
<ul>
<li><a href="#org4ddc084">2.1. External merge sort</a></li>
<li><a href="#orgfd2eb60">2.2. (Un)Clustered b+tree</a></li>
</ul>
</li>
<li><a href="#orgcc97127">3. Operations costs</a>
<ul>
<li><a href="#orge3b96d4">3.1. Simple selections</a></li>
<li><a href="#org5c79120">3.2. Projections duplicate</a></li>
<li><a href="#org01a6f97">3.3. Joins</a></li>
<li><a href="#orgecb180e">3.4. Union</a></li>
<li><a href="#orgcd958e3">3.5. Aggregate operations (avg, min)</a></li>
</ul>
</li>
<li><a href="#orgdf54e8f">4. Query rewriting</a>
<ul>
<li><a href="#orgcaefce0">4.1. De-correlation</a></li>
<li><a href="#org96bc68a">4.2. Flattening</a></li>
</ul>
</li>
<li><a href="#org0eeae24">5. Stats and catalog</a>
<ul>
<li><a href="#orgc80043e">5.1. Results estimation for selections</a></li>
<li><a href="#org61bca46">5.2. Results estimation for joins</a></li>
</ul>
</li>
<li><a href="#org9bf3858">6. Plan enumeration and costing</a>
<ul>
<li><a href="#org80a306e">6.1. Single-relation plan</a></li>
<li><a href="#org3413254">6.2. Over multiple relations</a></li>
</ul>
</li>
<li><a href="#org807b410">7. Conflict Serializable</a></li>
<li><a href="#orgd49097c">8. 2 phase locking 2PL</a></li>
<li><a href="#org688bf72">9. Deadlocks</a>
<ul>
<li><a href="#org1f44385">9.1. Detection</a></li>
<li><a href="#org595cab5">9.2. Prevention</a></li>
</ul>
</li>
<li><a href="#orge92119d">10. Locking Granularity</a>
<ul>
<li><a href="#orga74d8cd">10.1. Phantom problem</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orge2f9b08" class="outline-2">
<h2 id="orge2f9b08"><span class="section-number-2">1</span> B+trees</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Number of tuples = R tuples</li>
<li>Size of a page = B Bytes</li>
<li>Size of the index entry = E Bytes</li>
<li>Fanout F = B/E</li>
<li>Number of leaf pages = R/F</li>
<li>Height of the tree = log<sub>F</sub>(number of leaf pages) = cost of lookup</li>
</ul>
</div>
</div>
<div id="outline-container-org9299931" class="outline-2">
<h2 id="org9299931"><span class="section-number-2">2</span> Sorting</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org4ddc084" class="outline-3">
<h3 id="org4ddc084"><span class="section-number-3">2.1</span> External merge sort</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Number of passes with N pages and B buffers: 1 (initial sorting pass) + upper of (log B-1 upper(N/B))</li>
<li>Cost = 2*N*# of passes</li>
<li>To maintain number of pass with maximum number of pages, we get that in pass 0
we have upper(N/B) runs, then we need B - 1 &gt;= upper(N/B), i.e. large enough
to satisfy B * (B-1) &gt;= N (and check again the first one)</li>
</ul>
</div>
</div>
<div id="outline-container-orgfd2eb60" class="outline-3">
<h3 id="orgfd2eb60"><span class="section-number-3">2.2</span> (Un)Clustered b+tree</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Clustered is good, if alternative (1), very good, else, only cost to retrieve
data (always better than merge-sort)</li>
<li>Unclustered can be very bad, one record per page&#x2026;</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgcc97127" class="outline-2">
<h2 id="orgcc97127"><span class="section-number-2">3</span> Operations costs</h2>
<div class="outline-text-2" id="text-3">
<p>
Relation R with M pages, B buffers, Pr tuples per page
</p>
</div>
<div id="outline-container-orge3b96d4" class="outline-3">
<h3 id="orge3b96d4"><span class="section-number-3">3.1</span> Simple selections</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Select * from R where R.a &lt; x.
</p>
<ul class="org-ul">
<li>No index, unsorted: cost = R, full scan</li>
<li>No index, sorted, binary search + number of page of result (selectivity *
#pages)</li>
<li>Index, depends of alternatives, if clustered cost = lookup (= height of
tree) + selectivity * #pages, if not, cost is up to = lookup + selectivity * #
of tuples (small optimization, sort rid?)</li>
<li>For conditions, need to be cnf (bla or blo) and (blu or ble), fetch matching,
then filter, if several indexes, can intersect rids.
<ul class="org-ul">
<li>For B+tree, need to match prefix</li>
<li>For hash indexes, match all</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org5c79120" class="outline-3">
<h3 id="org5c79120"><span class="section-number-3">3.2</span> Projections duplicate</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>If using external merge sort, can be modified to remove duplicates in all the
passes, total cost: M + T + T (where T = # page after projection)</li>
<li>Hashing possible with same cost, but sensible to data skew and result not sorted.</li>
</ul>
</div>
</div>
<div id="outline-container-org01a6f97" class="outline-3">
<h3 id="org01a6f97"><span class="section-number-3">3.3</span> Joins</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Adding a second relation S with N pages, Ps tuples per page
</p>
</div>
<div id="outline-container-org7c50f12" class="outline-4">
<h4 id="org7c50f12"><span class="section-number-4">3.3.1</span> Nested loop joins</h4>
<div class="outline-text-4" id="text-3-3-1">
<ul class="org-ul">
<li>Naive simple nested loop: M + M*Pr*N (or N + N*Pr*M)</li>
<li>Page oriented loop: M + M * N</li>
<li>Using all available buffer, with R outer, S inner, create block of R, cost:
M(outer scan) + # outer blocks * N (inner scan), with #outer blocks = upper(#
of pages of outer / blocksize)</li>
</ul>
</div>
</div>
<div id="outline-container-org9f52e84" class="outline-4">
<h4 id="org9f52e84"><span class="section-number-4">3.3.2</span> Hash join</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
If B &gt; sqrt(f*N), where f is a fudge factor used to capture small increase in
size for building the hash table and N is the number of page of the smaller
relationship, cost is 3*(M+N).
</p>
</div>
</div>
<div id="outline-container-orge8a7301" class="outline-4">
<h4 id="orge8a7301"><span class="section-number-4">3.3.3</span> Sort Merge join</h4>
<div class="outline-text-4" id="text-3-3-3">
<ul class="org-ul">
<li>Basic cost: sorting of M + sorting of N + (N + M) (merging).</li>
<li>Possible to combine merging phase of sorting with merging phase of join, if B
&gt; sqrt(M) and B &gt; sqrt(N), then cost: 3*(M+N)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgecb180e" class="outline-3">
<h3 id="orgecb180e"><span class="section-number-3">3.4</span> Union</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>Sorting based:
<ul class="org-ul">
<li>Sort</li>
<li>Scan</li>
<li>Merge runs from pass 0 for both relations</li>
</ul></li>
<li>Hash based:
<ul class="org-ul">
<li>Partition R and S using h</li>
<li>For each S-partition, build in memory hash table with h2, scan R-partition
and add tuples while discarding duplicates</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgcd958e3" class="outline-3">
<h3 id="orgcd958e3"><span class="section-number-3">3.5</span> Aggregate operations (avg, min)</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>Without grouping:
<ul class="org-ul">
<li>In general, full scan</li>
<li>If relevant indexes, index-only scan</li>
</ul></li>
<li>With grouping:
<ul class="org-ul">
<li>Sort on group-by attr, the scan and compute aggregate for each group, can
combine sorting and aggregate</li>
<li>If tree index with all search attributes in select,where,group by clause,
can do index-only</li>
<li>If group-by attributes form prefix, can retrieve data entries/tuples in
group-by order.</li>
</ul></li>
</ul>
</div>
<div id="outline-container-org7d7fd27" class="outline-4">
<h4 id="org7d7fd27"><span class="section-number-4">3.5.1</span> Hybrid Hash join</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
Cf. book
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgdf54e8f" class="outline-2">
<h2 id="orgdf54e8f"><span class="section-number-2">4</span> Query rewriting</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgcaefce0" class="outline-3">
<h3 id="orgcaefce0"><span class="section-number-3">4.1</span> De-correlation</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Before:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #859900; font-weight: bold;">SELECT</span> S.sid
<span style="color: #859900; font-weight: bold;">FROM</span> Sailors S
<span style="color: #859900; font-weight: bold;">WHERE</span> S.sid <span style="color: #859900; font-weight: bold;">IN</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">SELECT</span> R.sid
  <span style="color: #859900; font-weight: bold;">FROM</span> Reserves R
  <span style="color: #859900; font-weight: bold;">WHERE</span> R.bid=<span style="color: #6c71c4;">103</span><span style="color: #2aa198;">)</span>
</pre>
</div>

<p>
After:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #859900; font-weight: bold;">SELECT</span> S.sid
<span style="color: #859900; font-weight: bold;">FROM</span> Sailors S
<span style="color: #859900; font-weight: bold;">WHERE</span> <span style="color: #859900; font-weight: bold;">EXISTS</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">SELECT</span> *
  <span style="color: #859900; font-weight: bold;">FROM</span> Reserves R
  <span style="color: #859900; font-weight: bold;">WHERE</span> R.bid=<span style="color: #6c71c4;">103</span>
  <span style="color: #859900; font-weight: bold;">AND</span> R.sid=S.sid<span style="color: #2aa198;">)</span>
</pre>
</div>

<p>
Advantage, subquery only evaluted once
</p>
</div>
</div>
<div id="outline-container-org96bc68a" class="outline-3">
<h3 id="org96bc68a"><span class="section-number-3">4.2</span> Flattening</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Before:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #859900; font-weight: bold;">SELECT</span> S.sid
<span style="color: #859900; font-weight: bold;">FROM</span> Sailors S, Reserves R
<span style="color: #859900; font-weight: bold;">WHERE</span> S.sid=R.sid
<span style="color: #859900; font-weight: bold;">AND</span> R.bid=<span style="color: #6c71c4;">103</span>
</pre>
</div>

<p>
After:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #859900; font-weight: bold;">SELECT</span> S.sid
<span style="color: #859900; font-weight: bold;">FROM</span> Sailors S
<span style="color: #859900; font-weight: bold;">WHERE</span> S.sid <span style="color: #859900; font-weight: bold;">IN</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">SELECT</span> R.sid
<span style="color: #859900; font-weight: bold;">FROM</span> Reserves R
<span style="color: #859900; font-weight: bold;">WHERE</span> R.bid=<span style="color: #6c71c4;">103</span><span style="color: #2aa198;">)</span>
</pre>
</div>

<p>
Advantage, can us ea join algorithm + optimizer can select among join algorithms
and reorder freely
</p>
</div>
</div>
</div>
<div id="outline-container-org0eeae24" class="outline-2">
<h2 id="org0eeae24"><span class="section-number-2">5</span> Stats and catalog</h2>
<div class="outline-text-2" id="text-5">
<p>
Values:
</p>
<ul class="org-ul">
<li># tuples (Ntuples) and # pages (Npages) per relation</li>
<li># distinct key values (Nkeys) for each index</li>
<li>low/high key values (Low/High) for each index</li>
<li>Index height (IHeight) for each tree index</li>
<li># Index pages (INPages) for each index</li>
</ul>
</div>
<div id="outline-container-orgc80043e" class="outline-3">
<h3 id="orgc80043e"><span class="section-number-3">5.1</span> Results estimation for selections</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>Result cardinality = max # tuples * product of all RF's</li>
<li>Term col=value (with index I on col): RF = 1/NKeys(I)</li>
<li>Term col &gt; value: RF = (High(I)-value)/(High(I)-Low(I))</li>
</ul>
</div>
</div>
<div id="outline-container-org61bca46" class="outline-3">
<h3 id="org61bca46"><span class="section-number-3">5.2</span> Results estimation for joins</h3>
<div class="outline-text-3" id="text-5-2">
<p>
General case: R<sub>cols</sub> &cap; S<sub>cols</sub> = {A} (and A is key for neither)
</p>
<ul class="org-ul">
<li>if NKey(A,S) &gt; NKeys(A,R): size = NTuples(R) * NTuples(S)/NKeys(A,S)</li>
<li>if NKey(A,R) &gt; NKeys(A,S): size = NTuples(R) * NTuples(S)/NKeys(A,R)</li>
<li>Overall: RF = 1/MAX(NKeys(A,S),NKeys(A,R))</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org9bf3858" class="outline-2">
<h2 id="org9bf3858"><span class="section-number-2">6</span> Plan enumeration and costing</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-org80a306e" class="outline-3">
<h3 id="org80a306e"><span class="section-number-3">6.1</span> Single-relation plan</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>Index on primary key matches selection, lookup cost:
<ul class="org-ul">
<li>If B+tree, height of tree</li>
<li>If hash, 1.2</li>
</ul></li>
<li>Clustered index match one or more conjucts: lookup + NPages(R) * product of RFs of
matchin select OR (NPages(I)+NPages(R)) * RFs</li>
<li>Unclustered index match one or more conjucts: NTuples(R) * product of RFs OR
(NPages(I) + NTuples(R)) * Rfs</li>
<li>File scan: NPages(R)</li>
</ul>
</div>
</div>
<div id="outline-container-org3413254" class="outline-3">
<h3 id="org3413254"><span class="section-number-3">6.2</span> Over multiple relations</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>Consider only left-deep join trees, allows for fully pipelined plans.</li>
<li>System R: Enumerate plans in N passes (N = # of relations joined), retain only
cheapest subplan overall + cheapest subplan for each interesting order (order
by, group by, join attr of other joins)</li>
<li>Always push all selection and projection as far down the plan as possible.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org807b410" class="outline-2">
<h2 id="org807b410"><span class="section-number-2">7</span> Conflict Serializable</h2>
<div class="outline-text-2" id="text-7">
<p>
Dependency graph:
</p>
<ul class="org-ul">
<li>One node per transaction</li>
<li>Edge from Ti to Tj if: an OP Oi of Ti conflicts with an OP Oj of Tj and Oi
appears earlier in the schedule than Oj</li>
</ul>
</div>
</div>
<div id="outline-container-orgd49097c" class="outline-2">
<h2 id="orgd49097c"><span class="section-number-2">8</span> 2 phase locking 2PL</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>If not strict, can have problem during release cascade, how to roll-back ?</li>
<li>If strict, all locks held by a transaction released only when transaction
complete</li>
</ul>
</div>
</div>
<div id="outline-container-org688bf72" class="outline-2">
<h2 id="org688bf72"><span class="section-number-2">9</span> Deadlocks</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-org1f44385" class="outline-3">
<h3 id="org1f44385"><span class="section-number-3">9.1</span> Detection</h3>
<div class="outline-text-3" id="text-9-1">
<p>
Create wait for graph, check for cycle
</p>
</div>
</div>
<div id="outline-container-org595cab5" class="outline-3">
<h3 id="org595cab5"><span class="section-number-3">9.2</span> Prevention</h3>
<div class="outline-text-3" id="text-9-2">
<ul class="org-ul">
<li>Assign priority based on timestamp: TSi &lt; TSj =&gt; priority(i) &gt; priority(j)</li>
<li>if Ti wants lock that Tj holds:
<ul class="org-ul">
<li>Wait-Die: If Ti has higher priority than Tj, Ti waits for Tj, else abort</li>
<li>Wound Wait: If Ti has higher priority, Tj aborted, else Ti waits.</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge92119d" class="outline-2">
<h2 id="orge92119d"><span class="section-number-2">10</span> Locking Granularity</h2>
<div class="outline-text-2" id="text-10">
<p>
New locks, Intention locks, IS, IX and SIX (S and IX).
</p>

<p>
Each transaction starts from root, to get S/X lock on a node, must hold IS/IX on
parent node, release in bottom up.
</p>

<p>
Compatibility of locks:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">IS</th>
<th scope="col" class="org-left">IX</th>
<th scope="col" class="org-left">S</th>
<th scope="col" class="org-left">X</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">IS</td>
<td class="org-left">ok</td>
<td class="org-left">ok</td>
<td class="org-left">ok</td>
<td class="org-left">no</td>
</tr>

<tr>
<td class="org-left">IX</td>
<td class="org-left">ok</td>
<td class="org-left">ok</td>
<td class="org-left">no</td>
<td class="org-left">no</td>
</tr>

<tr>
<td class="org-left">S</td>
<td class="org-left">ok</td>
<td class="org-left">no</td>
<td class="org-left">ok</td>
<td class="org-left">no</td>
</tr>

<tr>
<td class="org-left">X</td>
<td class="org-left">no</td>
<td class="org-left">no</td>
<td class="org-left">no</td>
<td class="org-left">no</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-orga74d8cd" class="outline-3">
<h3 id="orga74d8cd"><span class="section-number-3">10.1</span> Phantom problem</h3>
<div class="outline-text-3" id="text-10-1">
<p>
T1 wants max, but T2 insert new max, need predicate locking or index locking
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-06-26 Mon 10:45</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
